monsantoDocs/Product-booking-request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:urn1="urn:cidx:names:specification:ces:schema:all:5:3" xmlns:urn="urn:aggateway:names:ws:docexchange" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
	<soapenv:Header>
		<wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
			<wsse:UsernameToken xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="UsernameToken-BAFF8E68A8D786C41314389777816581">
				<wsse:Username>3350963</wsse:Username>
				<wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">USITsup$3</wsse:Password>
			</wsse:UsernameToken>
		</wsse:Security>
	</soapenv:Header>
	<soapenv:Body>
		<urn:inboundData>
			<urn:businessProcess>ProductBookingWS53</urn:businessProcess>
			<urn:processStep>ProductBookingWSRequest</urn:processStep>
			<urn:partnerId>1100032937530</urn:partnerId>
			<urn:partnerType>AGIIS-EBID</urn:partnerType>
			<urn:conversationId/>
			<urn:messageId>Test-ProductBooking5.3-1</urn:messageId>
			<urn:xmlPayload>
				<ProductBooking xsi:schemaLocation="urn:cidx:names:specification:ces:schema:all:5:3 file:///Y:/B2B/SC-II/5.3/Chem_eStandards_5.3_FINAL_QA_2013-09-30a.xsd" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns="urn:cidx:names:specification:ces:schema:all:5:3">
					<Header>
						<ThisDocumentIdentifier>
							<DocumentIdentifier>TEST-PB_1000</DocumentIdentifier>
						</ThisDocumentIdentifier>
						<ThisDocumentDateTime>
							<DateTime DateTimeQualifier="On">2019-06-03T12:15:30Z</DateTime>
						</ThisDocumentDateTime>
						<From>
							<PartnerInformation>
								<PartnerName>SHAWN SULLIVAN SEED</PartnerName>
								<PartnerIdentifier Agency="AGIIS-EBID">1100032937530</PartnerIdentifier>
								<ContactInformation>
									<ContactName>WS-XML</ContactName>
									<ContactDescription>DataSource</ContactDescription>
								</ContactInformation>
								<ContactInformation>
									<ContactName>2019</ContactName>
									<ContactDescription>SeedYear</ContactDescription>
								</ContactInformation>
								<ContactInformation>
									<ContactName>AgriDealer</ContactName>
									<ContactDescription>SoftwareName</ContactDescription>
								</ContactInformation>
								<ContactInformation>
									<ContactName>1.0.0</ContactName>
									<ContactDescription>SoftwareVersion</ContactDescription>
								</ContactInformation>
							</PartnerInformation>
						</From>
						<To>
							<PartnerInformation>
								<PartnerName>MONSANTO AGRICULTURAL CO</PartnerName>
								<PartnerIdentifier Agency="AGIIS-EBID">0062668030000</PartnerIdentifier>
							</PartnerInformation>
						</To>
					</Header>
					<!-- HERE WE PUT QUERY PARAMS-->
					<ProductBookingBody>
						<ProductBookingProperties>
							<!--CAN BE "New"(create) or "Changed"(edit)-->
							<ProductBookingType>New</ProductBookingType>
							<!--is generated by our system-->
							<ProductBookingOrderNumber>1000</ProductBookingOrderNumber>
							<!--   KN  is any product booking
							 		NE is only for summary requests
									ZZ is on summary requests response-->
							<ProductBookingOrderTypeCode Domain="ANSI-ASC-X12-92">KN</ProductBookingOrderTypeCode>
							<ProductBookingOrderIssuedDate>
								<DateTime DateTimeQualifier="On">2019-06-03T12:15:30Z</DateTime>
							</ProductBookingOrderIssuedDate>
							<LanguageCode Domain="ISO-639-2T">EN</LanguageCode>
							<CurrencyCode Domain="ISO-4217">USD</CurrencyCode>
							<BuyerSequenceNumber>0</BuyerSequenceNumber>
							<SoftwareInformation>
								<SoftwareSource>AgriDealer</SoftwareSource>
								<SoftwareVersion>1.0.0</SoftwareVersion>
							</SoftwareInformation>
							<ProductYear>2019</ProductYear>
							<ReferenceInformation ReferenceType="SalesOrderReference">
								<DocumentReference>
									<!--for "New" we use a 9999999999 placeholder, but for
									 "Changed" we use the identifier received on a response from a new booking using "New"-->
									<DocumentIdentifier>9999999999</DocumentIdentifier>
								</DocumentReference>
							</ReferenceInformation>
							<!--OPTIONAL-->
							<SpecialInstructions InstructionType="MarkingInstructions">West Farm</SpecialInstructions>
							<!--Constant-->
							<DirectShipFlag>0</DirectShipFlag>
						</ProductBookingProperties>
						<ProductBookingPartners>
							<!--SEED DEALER-->
							<Buyer>
								<PartnerInformation>
									<PartnerName>SHAWN SULLIVAN SEED</PartnerName>
									<PartnerIdentifier Agency="AGIIS-EBID">1100032937530</PartnerIdentifier>
									<AddressInformation>
										<AddressLine>74971 AVENUE 358</AddressLine>
										<CityName>WALLACE</CityName>
										<StateOrProvince>NE</StateOrProvince>
										<PostalCode>69169</PostalCode>
										<PostalCountry>US</PostalCountry>
									</AddressInformation>
								</PartnerInformation>
							</Buyer>
							<!--MONSNTO-->
							<Seller>
								<PartnerInformation>
									<PartnerName>MONSANTO AGRICULTURAL CO</PartnerName>
									<PartnerIdentifier Agency="AGIIS-EBID">0062668030000</PartnerIdentifier>
								</PartnerInformation>
							</Seller>
							<!--DEPENDS WHO WE WANT TO SHIP-->
							<ShipTo>
								<PartnerInformation>
									<PartnerName> BOYD GIGAX</PartnerName>
									<PartnerIdentifier Agency="GLN">1100031728863</PartnerIdentifier>
									<ContactInformation/>
									<AddressInformation>
										<AddressLine>73523 AVENUE 358A</AddressLine>
										<CityName>HAYES CENTER</CityName>
										<StateOrProvince>NE</StateOrProvince>
										<PostalCode>69032</PostalCode>
										<PostalCountry>US</PostalCountry>
									</AddressInformation>
								</PartnerInformation>
							</ShipTo>
							<!--GROWER-->
							<SoldTo>
								<PartnerInformation>
									<PartnerName>SHAWN SULLIVAN SEED</PartnerName>
									<PartnerIdentifier Agency="AGIIS-EBID">1100032937530</PartnerIdentifier>
								</PartnerInformation>
							</SoldTo>
							<!--SEED DEALER-->
							<Payer>
								<PartnerInformation>
									<PartnerName>SHAWN SULLIVAN SEED</PartnerName>
									<PartnerIdentifier Agency="AGIIS-EBID">1100032937530</PartnerIdentifier>
								</PartnerInformation>
							</Payer>
							<!--OPTIONAL-->
							<OtherPartner PartnerRole="FinancialInstitution">
								<PartnerInformation>
									<PartnerName>ABC FARM CMT</PartnerName>
									<PartnerIdentifier Agency="AssignedBySeller">386981</PartnerIdentifier>
									<AddressInformation>
										<AddressLine>PO BOX 188</AddressLine>
										<CityName>JEFFERSON</CityName>
										<StateOrProvince>IA</StateOrProvince>
										<PostalCode>50129-0188</PostalCode>
										<PostalCountry>US</PostalCountry>
									</AddressInformation>
								</PartnerInformation>
							</OtherPartner>
							<!--OPTIONAL-->
							<OtherPartner PartnerRole="SellingPartner">
								<PartnerInformation>
									<PartnerName>JOE SMITH</PartnerName>
									<PartnerIdentifier Agency="AssignedByBuyer">1234567</PartnerIdentifier>
								</PartnerInformation>
							</OtherPartner>
						</ProductBookingPartners>
						<!--EACH DETAIL CAN BE DIFFERENT DEPENDING ON ACTION REQUEST-->
						<ProductBookingDetails>
							<ProductBookingProductLineItem>
								<!--ID at product booking level, generated by monsanto, we send placeholder on new ones only
								 On edit and deletion, we have to pass the one that is received on creation
								 In case of edit and deletion, if a you are editing just 2 product in an order of 10, you must
								 only list 2 on edit order-->
								<LineNumber>999999</LineNumber>
								<!--CAN BE "Add", "Delete", "Increase", "Decrease"-->
								<ActionRequest>Add</ActionRequest>
								<!--CONSTANT-->
								<LineItemType>Sale</LineItemType>
								<!--THIS LINE NUMBER IS ALIKE(BUT NOT NECESSARILY THE SAME" AS THE ABOVE BUT IS GENERATED BY OUR SYSTEM, SO WE HAVE TO MAKE SURE
								WILL BE PERSISTENT AND CONSISTENT OVER EDIT AND DELETE REQUESTS-->
								<ProductBookingOrderLineItemNumber>1</ProductBookingOrderLineItemNumber>
								<!--PRODUCT ID USING AGIIS-->
								<ProductIdentification>
									<ProductIdentifier Agency="AGIIS-ProductID">00883580763448</ProductIdentifier>
								</ProductIdentification>
								<!--REQUIRED BUT NOT NECESSARILY WITH REAL DATA-->
								<ReferenceInformation ReferenceType="ContractNumber">
									<DocumentReference>
										<DocumentIdentifier>1</DocumentIdentifier>
									</DocumentReference>
								</ReferenceInformation>
								<IncreaseOrDecrease>
									<!--CAN BE Increase or Decrease-->
									<IncreaseOrDecreaseType>Increase</IncreaseOrDecreaseType>
									<ProductQuantityChange>
										<Measurement>
											<!-- This is just the decrement or increment quantity-->
											<MeasurementValue>50</MeasurementValue>
											<UnitOfMeasureCode Domain="UN-Rec-20">UN</UnitOfMeasureCode>
										</Measurement>
									</ProductQuantityChange>
								</IncreaseOrDecrease>
								<ProductQuantity>
									<Measurement>
										<!-- This is the quantity based on decrement or increment-->
										<MeasurementValue>50</MeasurementValue>
										<UnitOfMeasureCode Domain="UN-Rec-20">UN</UnitOfMeasureCode>
									</Measurement>
								</ProductQuantity>
								<RequestedShipDateTime>
									<DateTimeInformation>
										<DateTime DateTimeQualifier="After">2019-06-03T12:15:30Z</DateTime>
									</DateTimeInformation>
								</RequestedShipDateTime>
								<!-- OPTIONAL-->
								<SpecialInstructions InstructionType="General">Plant Early</SpecialInstructions>
							</ProductBookingProductLineItem>
							<ProductBookingProductLineItem>
								<LineNumber>999999</LineNumber>
								<ActionRequest>Add</ActionRequest>
								<LineItemType>Sale</LineItemType>
								<ProductBookingOrderLineItemNumber>4</ProductBookingOrderLineItemNumber>
								<ProductIdentification>
									<ProductIdentifier Agency="AGIIS-ProductID">00888346313967</ProductIdentifier>
								</ProductIdentification>
								<ReferenceInformation ReferenceType="ContractNumber">
									<DocumentReference>
										<DocumentIdentifier>1</DocumentIdentifier>
									</DocumentReference>
								</ReferenceInformation>
								<IncreaseOrDecrease>
									<IncreaseOrDecreaseType>Increase</IncreaseOrDecreaseType>
									<ProductQuantityChange>
										<Measurement>
											<MeasurementValue>25</MeasurementValue>
											<UnitOfMeasureCode Domain="UN-Rec-20">BG</UnitOfMeasureCode>
										</Measurement>
									</ProductQuantityChange>
								</IncreaseOrDecrease>
								<ProductQuantity>
									<Measurement>
										<MeasurementValue>25</MeasurementValue>
										<UnitOfMeasureCode Domain="UN-Rec-20">BG</UnitOfMeasureCode>
									</Measurement>
								</ProductQuantity>
								<RequestedShipDateTime>
									<DateTimeInformation>
										<DateTime DateTimeQualifier="After">2019-06-03T12:15:30Z</DateTime>
									</DateTimeInformation>
								</RequestedShipDateTime>
								<SpecialInstructions InstructionType="General">Plant Late</SpecialInstructions>
							</ProductBookingProductLineItem>
							<ProductBookingProductLineItem>
								<LineNumber>999999</LineNumber>
								<ActionRequest>Add</ActionRequest>
								<LineItemType>Sale</LineItemType>
								<ProductBookingOrderLineItemNumber>5</ProductBookingOrderLineItemNumber>
								<ProductIdentification>
									<ProductIdentifier Agency="AGIIS-ProductID">00883580952880</ProductIdentifier>
								</ProductIdentification>
								<ReferenceInformation ReferenceType="ContractNumber">
									<DocumentReference>
										<DocumentIdentifier>1</DocumentIdentifier>
									</DocumentReference>
								</ReferenceInformation>
								<IncreaseOrDecrease>
									<IncreaseOrDecreaseType>Increase</IncreaseOrDecreaseType>
									<ProductQuantityChange>
										<Measurement>
											<MeasurementValue>10</MeasurementValue>
											<UnitOfMeasureCode Domain="UN-Rec-20">BG</UnitOfMeasureCode>
										</Measurement>
									</ProductQuantityChange>
								</IncreaseOrDecrease>
								<ProductQuantity>
									<Measurement>
										<MeasurementValue>10</MeasurementValue>
										<UnitOfMeasureCode Domain="UN-Rec-20">BG</UnitOfMeasureCode>
									</Measurement>
								</ProductQuantity>
								<RequestedShipDateTime>
									<DateTimeInformation>
										<DateTime DateTimeQualifier="After">2019-06-03T12:15:30Z</DateTime>
									</DateTimeInformation>
								</RequestedShipDateTime>
								<SpecialInstructions InstructionType="General">Cover Crop</SpecialInstructions>
							</ProductBookingProductLineItem>
						</ProductBookingDetails>
					</ProductBookingBody>
				</ProductBooking>
			</urn:xmlPayload>
		</urn:inboundData>
	</soapenv:Body>
</soapenv:Envelope>
